# Missing values

In [1]:
data = pd.Series(['aa','bb',np.nan,'cc'])

In [2]:
data

0     aa
1     bb
2    NaN
3     cc
dtype: object

In [3]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()

0    aa
1    bb
3    cc
dtype: object

In [5]:
df = pd.DataFrame(np.random.randn(7,3))

In [6]:
df

          0         1         2
0 -1.761087 -0.697548  1.325258
1 -0.861643  1.654305  0.809705
2 -0.728688 -0.300742 -1.583394
3 -0.840283 -0.243590 -1.082668
4 -0.240125  0.536525 -1.718753
5  0.321257  0.030908  0.404193
6 -0.815983 -0.805954 -0.998488

In [7]:
df.iloc[:3,2] = np.nan

In [8]:
df

          0         1         2
0 -1.761087 -0.697548       NaN
1 -0.861643  1.654305       NaN
2 -0.728688 -0.300742       NaN
3 -0.840283 -0.243590 -1.082668
4 -0.240125  0.536525 -1.718753
5  0.321257  0.030908  0.404193
6 -0.815983 -0.805954 -0.998488

In [9]:
df2 = df.dropna()

In [10]:
df2

          0         1         2
3 -0.840283 -0.243590 -1.082668
4 -0.240125  0.536525 -1.718753
5  0.321257  0.030908  0.404193
6 -0.815983 -0.805954 -0.998488

In [11]:
df3 = df.dropna(axis=1)

In [12]:
df3

          0         1
0 -1.761087 -0.697548
1 -0.861643  1.654305
2 -0.728688 -0.300742
3 -0.840283 -0.243590
4 -0.240125  0.536525
5  0.321257  0.030908
6 -0.815983 -0.805954

In [13]:
df4=df.fillna(0)

In [14]:
df4

          0         1         2
0 -1.761087 -0.697548  0.000000
1 -0.861643  1.654305  0.000000
2 -0.728688 -0.300742  0.000000
3 -0.840283 -0.243590 -1.082668
4 -0.240125  0.536525 -1.718753
5  0.321257  0.030908  0.404193
6 -0.815983 -0.805954 -0.998488

In [16]:
df.fillna(0,inplace=True)

In [17]:
df

          0         1         2
0 -1.761087 -0.697548  0.000000
1 -0.861643  1.654305  0.000000
2 -0.728688 -0.300742  0.000000
3 -0.840283 -0.243590 -1.082668
4 -0.240125  0.536525 -1.718753
5  0.321257  0.030908  0.404193
6 -0.815983 -0.805954 -0.998488

# Duplicate

In [18]:
dup_df = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [19]:
dup_df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
dup_df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:
dup_df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
dup_df.drop_duplicates(['k1','k2'],keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [24]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                               'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [25]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [26]:
lower = data['food'].str.lower()

In [27]:
lower

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

lets add one col to the food which eat by animal

In [28]:
food_to_animal = {'bacon': 'pig',
                  'pulled pork': 'pig',
                  'pastrami': 'cow',
                  'corned beef': 'cow',
                  'honey ham': 'pig',
                  'nova lox': 'salmon'
                  }

# MAPPING

In [29]:
data['animal'] = lower.map(food_to_animal)

In [30]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [32]:
# Alternate way
data['animal_lambda']=data.food.map(lambda x:food_to_animal[x.lower()])

In [33]:
data

          food  ounces  animal animal_lambda
0        bacon     4.0     pig           pig
1  pulled pork     3.0     pig           pig
2        bacon    12.0     pig           pig
3     Pastrami     6.0     cow           cow
4  corned beef     7.5     cow           cow
5        Bacon     8.0     pig           pig
6     pastrami     3.0     cow           cow
7    honey ham     5.0     pig           pig
8     nova lox     6.0  salmon        salmon

# Replace

In [34]:
data2 = pd.Series([1., -999., 2., -999., -1000., 3.])

In [35]:
data2

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data2.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data2.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
data3  = pd.DataFrame(
                      np.arange(12).reshape((3,4)),
                      index=['aa','bb','cc'],
                      columns=['one','two','three','four']
                      )

In [40]:
data3

    one  two  three  four
aa    0    1      2     3
bb    4    5      6     7
cc    8    9     10    11

In [41]:
capital_word = lambda x:x[:4].upper()

In [42]:
data3.index.map(capital_word)

Index(['AA', 'BB', 'CC'], dtype='object')

In [44]:
data3.index = data3.index.map(capital_word)

In [45]:
data3

    one  two  three  four
AA    0    1      2     3
BB    4    5      6     7
CC    8    9     10    11

In [47]:
data3 = data3.rename(columns=str.upper)

In [48]:
data3

    ONE  TWO  THREE  FOUR
AA    0    1      2     3
BB    4    5      6     7
CC    8    9     10    11